<?php
//赋值运算符
header('content-type:text/html;charset=utf-8');

$i = 89; //将89赋予变量$i

echo $i , '<br/><br/>';

$i = $i + 5; //将变量$i与5的和赋予变量$i

//$i(新值) = $i(旧值) + 5
echo $i , '<br/><br/>';

//可以简写为

echo '变量$i的值是:' , $i  , '<br/><br/>';

$i += 5; //原型就是 $i = $i + 5;    

echo '$i += 5的结果是:' ,  $i , '<br/><br/>';

////////////////////////////////////

$n = 7;

echo '变量$n的值是:' , $n , '<br/><br/>';

$n -= 5; //原型就是 $n = $n - 5

echo '$n -= 5的结果是:'  ,   $n , '<br/><br/>';

$n *= 10; //原型就是 $n = $n * 10;

echo '$n *= 10的结果是:' ,  $n , '<br/><br/>';

$n /= 5; //原型就是 $n = $n / 5

echo '$n /= 5的结果是:' ,  $n , '<br/><br/>';


########################################

$s1 = '中';


echo '变量$s1的值是:' , $s1 , '<br/><br/>';

$s1 .= '国'; //原型就是$s1 = $s1 . '国',结果为'中国'


echo '$s1 .= &#39;国&#39;的结果是:' , $s1 , '<br/><br/>';

$s1 = '我爱' . $s1;

echo '如果要得到&#39;我爱中国&#39;那么只能通过点(.)进行字符连接!<br/><br/>';

echo '语法为:<br/><br/>';

echo '$s1 = &#39;我爱&#39; . $s1';














